# Pandas Exploration

# import libraries

In [1]:
import pandas as pd
import numpy as np

# Series & Index 설정

In [2]:
obj = pd.Series([4, 7, -5, 3],index = ['a','b','c','d'])

In [3]:
obj.values

array([ 4,  7, -5,  3])

In [4]:
obj.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [5]:
#Dict -> 자료형으로 변경하기
sdata = {'Kim': 35000, 'Beomwoo': 67000, 'Joan': 12000, 'Choi': 4000}
obj3 = pd.Series(sdata)
obj3

Kim        35000
Beomwoo    67000
Joan       12000
Choi        4000
dtype: int64

In [6]:
#이름 설정 & index 설정
obj3.name = "NAME"
obj3.index.name = "Names"
obj3

Names
Kim        35000
Beomwoo    67000
Joan       12000
Choi        4000
Name: NAME, dtype: int64

# DataFrame - series를 여러 개 합친

In [7]:
dict_data = {'c0':[1,2,3],'c1':[4,5,6],'c2':[7,8,9],'c3':[10,11,12],'c4':[13,14,15]}
#DataFrame만들가
df=pd.DataFrame(dict_data)
df

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [8]:
#열 이름 바꾸기
df.columns = ['1','2','3','4','5']
#행 이름 바꾸기
df.index = ['a','b','c']
df

   1  2  3   4   5
a  1  4  7  10  13
b  2  5  8  11  14
c  3  6  9  12  15

In [9]:
#열 이름 바꾸기
df.rename(columns={'1':'0'}, inplace = True)
df

   0  2  3   4   5
a  1  4  7  10  13
b  2  5  8  11  14
c  3  6  9  12  15

In [10]:
#복사 -> DROP

df2=df.copy()
#행 drop
df2.drop('a',inplace=True)
#열 drop
df2.drop('3',axis=1,inplace=True)
df2

   0  2   4   5
b  2  5  11  14
c  3  6  12  15

# DataFrame indexing
loc = 이름으로 indexing
iloc = 숫자로 indexing

In [11]:
exam_data = {'수학':[90,80,70], '영어':[98,89,95],
            '음악':[85,95,100], '체육':[100,90,90]}

In [12]:
df4 = pd.DataFrame(exam_data, index = ['a','b','c'])
df4

   수학  영어   음악   체육
a  90  98   85  100
b  80  89   95   90
c  70  95  100   90

In [13]:
#row기준으로 자르기 
label1 = df4.loc['b'] #index b / row b 가져오기
label2 = df4.iloc[2] #두번째 position (즉 c) 가져오기
label1
label2

수학     70
영어     95
음악    100
체육     90
Name: c, dtype: int64

In [14]:
#row기준으로 자르기 (2개이상) #이러면 data frame으로 가져옴 
label3 = df4.loc[['b','c']]
label3

   수학  영어   음악  체육
b  80  89   95  90
c  70  95  100  90

In [15]:
#열 기준으로 자르기 - dataframe으로 만들려면 "[[]]"
df4[['수학']] 
#2개 이상으로 열 자르기
df4[['수학','영어']]

   수학  영어
a  90  98
b  80  89
c  70  95

조건을 가지고 indexing

In [16]:
df4['수학'] > 70

a     True
b     True
c    False
Name: 수학, dtype: bool

In [17]:
#df4 '수학'열 에서 70 넘은 row 모두 다 출력 
df4.loc[df4['수학'] > 70,:]

   수학  영어  음악   체육
a  90  98  85  100
b  80  89  95   90

In [18]:
#df4 '수학'열 에서 80 넘은 row 모두 출력 & 열 출력할 것 설정모두 다 출력 
df4.loc[df4['수학'] > 70, ['영어','음악']]

   영어  음악
a  98  85
b  89  95

In [19]:
#조건 두개
df4.loc[(df4['수학']>70)&(df4['수학']<90),:]

   수학  영어  음악  체육
b  80  89  95  90

# Transpose, info, describe, shape

In [20]:
#transpose
df4.transpose()

      a   b    c
수학   90  80   70
영어   98  89   95
음악   85  95  100
체육  100  90   90

In [21]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, a to c
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   수학      3 non-null      int64
 1   영어      3 non-null      int64
 2   음악      3 non-null      int64
 3   체육      3 non-null      int64
dtypes: int64(4)
memory usage: 228.0+ bytes

In [22]:
df4.describe()

         수학         영어          음악          체육
count   3.0   3.000000    3.000000    3.000000
mean   80.0  94.000000   93.333333   93.333333
std    10.0   4.582576    7.637626    5.773503
min    70.0  89.000000   85.000000   90.000000
25%    75.0  92.000000   90.000000   90.000000
50%    80.0  95.000000   95.000000   90.000000
75%    85.0  96.500000   97.500000   95.000000
max    90.0  98.000000  100.000000  100.000000

In [23]:
df4.shape

(3, 4)

# Missing Value - DROP NaN

In [24]:
# Random 으로 만들기
df = pd.DataFrame(np.random.randn(6,4))
df

          0         1         2         3
0 -0.959764  0.396396  0.666594  0.026184
1  1.541180  1.231345  0.578535 -0.620501
2 -1.123822 -1.198526 -0.238716  1.135752
3 -1.639327 -1.818252  1.609605 -0.762939
4  0.468407  0.127744 -1.192614 -1.336123
5 -1.527674 -1.312198 -0.325106 -0.306450

In [25]:
df.columns = ['a','b','c','d']
df.index = ['1','2','3','4','5','6']
df

          a         b         c         d
1 -0.959764  0.396396  0.666594  0.026184
2  1.541180  1.231345  0.578535 -0.620501
3 -1.123822 -1.198526 -0.238716  1.135752
4 -1.639327 -1.818252  1.609605 -0.762939
5  0.468407  0.127744 -1.192614 -1.336123
6 -1.527674 -1.312198 -0.325106 -0.306450

In [26]:
#임의로 NaN을 넣어버리겠음, e column에다가 넣음
df['e'] = [np.nan, np.nan, np.nan, 1, 1, 1]

#임의로 random사용해서 f열에 넣어버리겠음
df['f'] = np.random.randn(6,1)
df

          a         b         c         d    e         f
1 -0.959764  0.396396  0.666594  0.026184  NaN  0.555123
2  1.541180  1.231345  0.578535 -0.620501  NaN  0.791073
3 -1.123822 -1.198526 -0.238716  1.135752  NaN  0.368378
4 -1.639327 -1.818252  1.609605 -0.762939  1.0 -0.634636
5  0.468407  0.127744 -1.192614 -1.336123  1.0  0.380448
6 -1.527674 -1.312198 -0.325106 -0.306450  1.0  0.638616

In [27]:
#NaN 없애기
df.dropna(how = 'any')

          a         b         c         d    e         f
4 -1.639327 -1.818252  1.609605 -0.762939  1.0 -0.634636
5  0.468407  0.127744 -1.192614 -1.336123  1.0  0.380448
6 -1.527674 -1.312198 -0.325106 -0.306450  1.0  0.638616

In [28]:
#열 모든값이 null인경우에 drop
df.dropna(how = 'all')

          a         b         c         d    e         f
1 -0.959764  0.396396  0.666594  0.026184  NaN  0.555123
2  1.541180  1.231345  0.578535 -0.620501  NaN  0.791073
3 -1.123822 -1.198526 -0.238716  1.135752  NaN  0.368378
4 -1.639327 -1.818252  1.609605 -0.762939  1.0 -0.634636
5  0.468407  0.127744 -1.192614 -1.336123  1.0  0.380448
6 -1.527674 -1.312198 -0.325106 -0.306450  1.0  0.638616

In [29]:
df.dropna(subset = ['e'], axis = 0)

          a         b         c         d    e         f
4 -1.639327 -1.818252  1.609605 -0.762939  1.0 -0.634636
5  0.468407  0.127744 -1.192614 -1.336123  1.0  0.380448
6 -1.527674 -1.312198 -0.325106 -0.306450  1.0  0.638616

# Fill & Replace

In [30]:
#null에 fill
df.fillna(value=0.5)

          a         b         c         d    e         f
1 -0.959764  0.396396  0.666594  0.026184  0.5  0.555123
2  1.541180  1.231345  0.578535 -0.620501  0.5  0.791073
3 -1.123822 -1.198526 -0.238716  1.135752  0.5  0.368378
4 -1.639327 -1.818252  1.609605 -0.762939  1.0 -0.634636
5  0.468407  0.127744 -1.192614 -1.336123  1.0  0.380448
6 -1.527674 -1.312198 -0.325106 -0.306450  1.0  0.638616

In [31]:
df.isnull()
print(df.isnull().sum())

a    0
b    0
c    0
d    0
e    3
f    0
dtype: int64

In [32]:
#Replace null with 24
df.replace(np.nan, 24)

          a         b         c         d     e         f
1 -0.959764  0.396396  0.666594  0.026184  24.0  0.555123
2  1.541180  1.231345  0.578535 -0.620501  24.0  0.791073
3 -1.123822 -1.198526 -0.238716  1.135752  24.0  0.368378
4 -1.639327 -1.818252  1.609605 -0.762939   1.0 -0.634636
5  0.468407  0.127744 -1.192614 -1.336123   1.0  0.380448
6 -1.527674 -1.312198 -0.325106 -0.306450   1.0  0.638616

# Correlation구하기

In [33]:
df['a'].corr(df['c'])

-0.25659291189061134

# 유익한 꼭 알았으면 하는것

In [34]:
df4

   수학  영어   음악   체육
a  90  98   85  100
b  80  89   95   90
c  70  95  100   90

In [35]:
df4.groupby(['수학'])['영어'].count()

수학
70    1
80    1
90    1
Name: 영어, dtype: int64

In [36]:
#apply
def profit(s):
    return s + s * 0.10 # increase of 10%


## example) df['new_price'] = df['price'].apply(profit)

In [37]:
df.head()

          a         b         c         d    e         f
1 -0.959764  0.396396  0.666594  0.026184  NaN  0.555123
2  1.541180  1.231345  0.578535 -0.620501  NaN  0.791073
3 -1.123822 -1.198526 -0.238716  1.135752  NaN  0.368378
4 -1.639327 -1.818252  1.609605 -0.762939  1.0 -0.634636
5  0.468407  0.127744 -1.192614 -1.336123  1.0  0.380448

In [38]:
#Capitalize Brand name
#부분적으로 적용 
# brands = ['Victor Hugo', 'James Scott Bell']
# cond = df['author'].isin(brands) #is in 또는 ~df
# df['author'][cond] = df['author'][cond].str.lower()
# df['author'].unique() # total of 9 brands